"Error: wrong bbis signature" = "Error: wrong bbis signature";
"Error: wrong blhr signature" = "Error: wrong blhr signature";
"Error: zlib initialization error" = "Error: zlib initialization error";
"Error: input size is bigger than output" = "Error: input size is bigger than output";
"Error: unknown type" = "Error: unknown type";
"Error: the truncated file is smaller than how much I requested" = "Error: the truncated file is smaller than how much I requested";
"Error: incomplete input file" = "Error: incomplete input file";
"Error: problems during the writing of the output file" = "Error: problems during the writing of the output file";
"Error: the input lzma block is too short" = "Error: the input lzma block is too short";
"Error: the compressed LZMA input is wrong or incomplete" = "Error: the compressed LZMA input is wrong or incomplete";
"Error: the compressed input is wrong or incomplete" = "Error: the compressed input is wrong or incomplete";
"Error: the magiciso_is_shit encryption can't work on your system" = "Error: decryption only supported on Intel processors";
"Error: this executable has been compiled without support for magiciso_is_shit" = "Error: decryption not compiled in";